# ЧТО ДЕЛАЕТ LOWER
# Выведите с помощью функции print встроенную документацию к методу строк lower.
print(str.lower.__doc__)
