"""ФАКТОРИАЛ"""
# Факториал числа N — это произведение всех целых чисел от 1 до N.
# Например, факториал 5 равен 120 и вычисляется так:
#
# Вычисление факториала 5
# Напишите программу, которая принимает первым аргументом командной строки число n,
# а затем вычисляет факториал этого числа и печатает результат. Используйте цикл while.
#
# Пример использования:
# > python program.py 5
# 120

import sys
#  v1
# n = int(sys.argv[1])
# i = 1
# result = 1
# while i <= n:
#     result *= i
#     i += 1
# print(result)

# v2
# n = int(sys.argv[1])
# result = 1
# for i in range(1, n + 1):
#     result *= i
# print(result)

