"""СПИСОК ПОДХОДЯЩИХ ПРОГРАММИСТОВ"""
# В редакторе ниже содержится список программистов. Каждый программист представлен словарем из трёх элементов: id, язык (lang) и активность (active).
#
# Напишите программу, которая получает из первого аргумента командной строки название языка программирования, а затем выводит идентификаторы активных программистов, которые пишут на переданном языке. Идентификаторы должны быть отсортированы в порядке возрастания и разделены запятыми.
#
# Программа гарантированно будет получать только те названия языков, которые есть в списке.
#
# Пример использования:
# > python program.py python
# > 55, 84, 88
# TODO доделать упражнение

